### 4. HBase的 常用的 Shell  操作

#### 1) satus

显示服务器状态,注意字面量要加上**`''`**以区分

```shell
hbase(main):001:0> status
1 active master, 1 backup masters, 3 servers, 0 dead, 6.0000 average load

hbase(main):002:0> status hadoop102
NameError: undefined local variable or method `hadoop102' for #<Object:0x59a2388e>

hbase(main):003:0> status 'hadoop102'
1 active master, 1 backup masters, 3 servers, 0 dead, 6.0000 average load
```

#### 2) whoami

显示 HBase 当前用户，例如：

```shell
hbase(main):006:0> whoami
wxy (auth:SIMPLE)
    groups: wxy
```

#### 3) list

显示当前所有的表

```
hbase(main):007:0> list
TABLE                        
fruit                                    
fruit_mr                                     
hbase_book                           
hbase_emp_table                     
ns_telecom:calllog                    
ns_weibo:content                        
ns_weibo:inbox                        
ns_weibo:relation                     
staff                              
student                                   
10 row(s) in 0.0600 seconds

=> ["fruit", "fruit_mr", "hbase_book", "hbase_emp_table", "ns_telecom:calllog", "ns_weibo:content", "ns_weibo:inbox", "ns_weibo:relation", "staff", "student"]
```

#### 4) count

统计指定表的记录数，例如：

```
hbase(main):011:0> count 'ns_telecom:calllog'
Current count: 1000, row: 00_18605966993_20180915134055_18774437106_0_0728             Current count: 2000, row: 01_16664106815_20180629040411_14188256920_0_1189
Current count: 3000, row: 02_14439184317_20180126173010_18693177921_0_1039 
Current count: 4000, row: 02_19762517257_20180310014504_14439184317_0_0734
Current count: 5000, row: 03_17867350108_20180126152314_18605966993_1_0772
Current count: 6000, row: 04_15934735544_20180413162433_16665428794_0_0400
Current count: 7000, row: 05_14126908508_20180117101552_19306435504_1_0043
Current count: 8000, row: 05_18693177921_20181026194123_14126908508_0_1011 
8340 row(s) in 3.6890 seconds

=> 8340
```

#### 5) describe

展示表结构信息

```
describe 'ns_telecom:calllog'
Table ns_telecom:calllog is ENABLED    
ns_telecom:calllog, {TABLE_ATTRIBUTES => {coprocessor$1 => '|com.wxy.coprocessor.CalleeWriteObserver|1073741823|'}            
COLUMN FAMILIES DESCRIPTION            
{NAME => 'f1', BLOOMFILTER => 'ROW', VERSIONS => '3', IN_MEMORY => 'false', KEEP_DELETED_CELLS => 'FALSE', DATA_BLOCK_ENCODING => 'NONE', TTL => 'FOREVER', COMPRESSION => 'NONE', MIN_VERSIONS => '0', BLOCKCACHE => 't
rue', BLOCKSIZE => '65536', REPLICATION_SCOPE => '0'} 
{NAME => 'f2', BLOOMFILTER => 'ROW', VERSIONS => '3', IN_MEMORY => 'false', KEEP_DELETED_CELLS => 'FALSE', DATA_BLOCK_ENCODING => 'NONE', TTL => 'FOREVER', COMPRESSION => 'NONE', MIN_VERSIONS => '0', BLOCKCACHE => 't
rue', BLOCKSIZE => '65536', REPLICATION_SCOPE => '0'}                                                                                            
2 row(s) in 0.0550 seconds
```

#### 6) exist

检查表是否存在，适用于表量特别多的情况
hbase> exist 'hbase_book'

#### 7) is_enabled/is_disabled

检查表是否启用或禁用
hbase> is_enabled 'hbase_book'
hbase> is_disabled 'hbase_book'

#### 8) alter

该命令可以改变表和列族的模式，例如：

#### 9) disable

禁用一张表
hbase> disable 'hbase_book'

#### 10) drop

删除一张表，记得在删除表之前必须先禁用
hbase> drop 'hbase_book'

#### 11) delete

删除一行中一个单元格的值，例如：
hbase> delete ‘hbase_book’, ‘rowKey’, ‘CF:C’

#### 12) truncate

清空表数据，即禁用表-删除表-创建表
hbase> truncate 'hbase_book'

#### 13) create

创建表，例如：
hbase> create ‘table’, ‘cf’
创建多个列族：
hbase> create 't1', {NAME => 'f1'}, {NAME => 'f2'}, {NAME => 'f3'}